# Pandas----Statistics

In [1]:
import pandas as pd
import numpy as np

In [5]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], 
                  [np.nan, np.nan], [0.75, -1.3]],
                  index = ['a', 'b', 'c', 'd'], columns = ['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [6]:
# sum()
df.sum()

one    9.25
two   -5.80
dtype: float64

In [7]:
df.sum(axis = 1)  # or axis = 'columns'

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [8]:
# the NaN will be skipped, but if we want to detect NA, we adjust 'skipna'
df.sum(axis = 'columns', skipna = False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [10]:
# compute the index of max or min (excludes NaN)
# idxmax(), idxmin()
df.idxmax()

one    b
two    d
dtype: object

In [11]:
df.idxmin()

one    d
two    b
dtype: object

In [12]:
# compute cumulative value
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

## using describe( ) to output many information directly

In [13]:
df = pd.DataFrame(np.arange(12).reshape(4, 3),
                  index = list('abcd'), columns = ['one', 'two', 'three'])
df

   one  two  three
a    0    1      2
b    3    4      5
c    6    7      8
d    9   10     11

In [14]:
df.describe()

            one        two      three
count  4.000000   4.000000   4.000000
mean   4.500000   5.500000   6.500000
std    3.872983   3.872983   3.872983
min    0.000000   1.000000   2.000000
25%    2.250000   3.250000   4.250000
50%    4.500000   5.500000   6.500000
75%    6.750000   7.750000   8.750000
max    9.000000  10.000000  11.000000

In [15]:
# For non-numeric data, describe() outputs a different data
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [16]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

## 1 Correlation and Covariance

In [17]:
# read data from files 
price = pd.read_pickle('yahoo_price.pkl')
volume = pd.read_pickle('yahoo_volume.pkl')

In [18]:
price.head()

                 AAPL        GOOG         IBM       MSFT
Date
2010-01-04  27.990226  313.062468  113.304536  25.884104
2010-01-05  28.038618  311.683844  111.935822  25.892466
2010-01-06  27.592626  303.826685  111.208683  25.733566
2010-01-07  27.541619  296.753749  110.823732  25.465944
2010-01-08  27.724725  300.709808  111.935822  25.641571

In [20]:
volume.head()

                 AAPL      GOOG      IBM      MSFT
Date
2010-01-04  123432400   3927000  6155300  38409100
2010-01-05  150476200   6031900  6841400  49749600
2010-01-06  138040000   7987100  5605300  58182400
2010-01-07  119282800  12876600  5840600  50559700
2010-01-08  111902700   9483900  4197200  51197400

In [23]:
# pct_change() computes the change between two neighbor numbers 
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [24]:
# compute correlation & covariance of two columns
returns['MSFT'].cov(returns['IBM'])

8.870655479703546e-05

In [25]:
returns['MSFT'].corr(returns['IBM'])

0.49976361144151155

In [26]:
# some fast method
returns.MSFT.corr(returns.IBM)

0.49976361144151155

In [27]:
# Covariance matrix
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [28]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [29]:
# use corrwith() to return a series
returns.corrwith(returns.IBM)

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [30]:
# we can utilize the matching nature of indexes to compute
# correlation between price and volume
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

In [31]:
# set axis = 'columns' can compute row-by-row

## 2 Unique values, Value counts & Membership

In [32]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [33]:
obj.unique()  # though not in order, we can sort it anyway

array(['c', 'a', 'd', 'b'], dtype=object)

In [36]:
# count the frequency, it presents in descending order
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

### use isin to check the existence of values in a set

In [37]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [39]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [40]:
# use it to pick particular values
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

### get_indexer( ) method

In [41]:
# returns an array to tell us the index of repeating values in the series
# composed by uniques values
match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
unique_values = pd.Series(['c', 'a', 'b'])

In [42]:
pd.Index(unique_values).get_indexer(match)

array([0, 1, 2, 2, 0, 1], dtype=int64)

In [43]:
# For dataframe
df = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                   'Qu2': [2, 3, 1, 2, 3],
                   'Qu3': [1, 5, 2, 4, 4]})
df

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [45]:
# pass value_counts() to apply()
df.apply(pd.value_counts)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [ ]:
# left column index represents the labels, the main body numbers represents 
# the number of this index appears in this column